<?php
/* Задание 1
Установить программное обеспечение: веб-сервер, базу данных, интерпретатор, текстовый редактор.
Проверить, что все работает правильно.

- установила PhpStorm и ПО MAMP (т.к. работаю на маке)
*/



/* Задание 3
Объяснить, как работает данный код:
*/
$a = 5;
$b = '05';
var_dump($a == $b);                       // true - т.к. сравнение '==' сравнивает только значения
var_dump((int)'012345');                            // 12345 - 'int' - приведение к числу, строка 012345 будет равна 12345
var_dump((float)123.0 === (int)123.0);    // false - 'int' - целое число, a float - число с плавающей точкой.
                                                    // Т.к сравнение строгое, сравниваются и значения и тип данных
var_dump((int)0 === (int)'hello, world'); // true -  (int)'hello, world' преобразована в 0





/* Задание 4
Используя имеющийся HTML-шаблон, сделать так, чтобы главная страница генерировалась через PHP.
Создать блок переменных в начале страницы.
Сделать так, чтобы 'h1', title и текущий год генерировались в блоке контента из созданных переменных.
*/
$title = 'Title 1';
$content = 'Content';
$date = date('d.m.Y');
?>

<h1><?php echo $title?></h1>
<p><?php echo $content?></p>
<p><?php echo  $date?></p>



<?php
/* Задание 5
* Используя только две переменные, поменяйте их значение местами.
Например, если a = 1, b = 2, надо, чтобы получилось b = 1, a = 2.
Дополнительные переменные использовать нельзя.
*/
$a = 1;
$b = 2;

$a = $b + $a; //$a = 3
$b = $a - $b; //$b = 1
$a = $a - $b; //$a = 2

echo $a .'<br>';
echo $b;
?>
